#include <stdio.h>
#include <iostream>
#include <math.h>
#include <locale.h>

/*
* Ввод коэфициентов
* @param letter - буква коэфициента
* @return coeff - коэфициент
*/
float index(char letter)
{
	float coeff;
	printf("Введите коэффициент %c : ", letter);
	//ввод данных
	scanf_s("%f", &coeff);
	return coeff;
}

int main()
{
	//поключение русского языка
	setlocale(LC_ALL, "Rus");
	//объявление переменных
	float a1, b1, c1, a2, b2, c2, x, y, ugol, t, k1, k2, d1, d2;
	//вывод условия ввода
	printf("*******************************************\n"
		"Уравнение прямых вводятся в виде: ax+by+c=0\n"
		"*******************************************\n"
		" 1-ая прямая:\n");
	//Ввод коэфициентов уравнения первой прямой
	a1 = index('a');
	b1 = index('b');
	c1 = index('c');
	printf("*******************************************\n"
		" 2-ая прямая:\n");
	//Ввод коэфициентов уравнения второй прямой
	a2 = index('a');
	b2 = index('b');
	c2 = index('c');
	//Вычисление коэфицтентов для уравнения вида y=kx+d
	k1 = -(a1 / b1);
	d1 = -(c1 / b1);
	k2 = -(a2 / b2);
	d2 = -(c2 / b2);
	//вычисления угла пересечения двух прямых
	ugol = atan((k2 - k1) / (1 + k1*k2));
	//вычисление координат точки пересечения двух прямых
	t = a1 * b2 - a2 * b1;
	x = (b1 * c2 - b2 * c1) / t;
	y = (a2 * c1 - a1 * c2) / t;
	//вывод результатов
	printf("\n*******************************************\n"
		"Уравнение первой прямой\n"
		"   y = %.2fx + (%.2f)\n", k1, d1);
	printf("Уравнение второй прямой\n"
		"   y = %.2fx + (%.2f)\n", k2, d2);
	printf("Угол пересечения двух прямых (в градусах)\n"
		"   %5.2f°\n", ugol * 57);
	printf("Точка пересечения:\n");
	printf("   x = %.2f\n", x);
	printf("   y = %.2f\n"
		"*******************************************\n", y);
	system("pause");
	return 0;
}